In [2]:
import numpy as np
import pandas as pd

In [4]:
marks_list= [55,25,75,40,90]
marks_arr= np.array(marks_list)
series_list=pd.Series(marks_list)
series_list=pd.Series(marks_arr)
print(marks_list)
print(marks_arr)

[55, 25, 75, 40, 90]
[55 25 75 40 90]

In [6]:
labeled_series = pd.Series(marks_list, index=['A','B','C','D','E'])
labeled_series

A    55
B    25
C    75
D    40
E    90
dtype: int64

In [ ]:
#mathematical operations

In [26]:
#pandas dataframe- 2D tabular data structure with labeled axes
student = ['Mary','Shivani','Arpita','Susan','Vishal']
df1=pd.DataFrame(student,columns=['Student'],index=['A','B','C','D','E'])
df1

   Student
A     Mary
B  Shivani
C   Arpita
D    Susan
E   Vishal

In [40]:
# student = ['Mary','Shivani','Arpita','Susan','Vishal']
# grade=['B-','A+','A-','B+','C']
# num=[10,11,12,13,14]
# roll=[123,124,125,126,127]
# df2 = pd.DataFrame({
#     'Student': student,
#     'Grade': grade,
#     'Num': num,
#     'Roll': roll})
# df2    [OR]
student = ['Mary','Shivani','Arpita','Susan','Vishal']
grade=['B-','A+','A-','B+','C']
df2=df2 = pd.DataFrame({
    'Student': student,
    'Grade': grade})
df2['num']=[10,11,12,13,14]
df2['roll']=[123,124,125,126,127]
df2

   Student Grade  num  roll
0     Mary    B-   10   123
1  Shivani    A+   11   124
2   Arpita    A-   12   125
3    Susan    B+   13   126
4   Vishal     C   14   127

In [42]:
#creating DataFrame using Random values
np.random.randn(5,2)

array([[-0.27137784, -0.69541522],
       [-0.29516201,  0.00597795],
       [ 1.27585586, -0.37726901],
       [-0.70054043,  1.2339157 ],
       [-1.80094943,  1.4349776 ]])

In [102]:
df3=pd.DataFrame(np.random.randint(1,10, size=(5,2)),columns=['Column 1','Column 2'])
#df3.index=(1,2,3,4,5)
df3

   Column 1  Column 2
0         1         7
1         4         5
2         9         3
3         6         2
4         7         2

In [108]:
#slicing 
df3[:3] #first 3
df3[-2:] #last 2
df3[2:3]

   Column 1  Column 2
2         9         3

In [120]:
# .iloc[row_index, column_index]
# loc for rows and columns

(  Student Grade  num  roll
 2  Arpita    A-   12   125,
 [1, 2])

In [150]:
#from df2 - ',' for specific values
df2.loc[[1,4],['Student','num']]

   Student  num
1  Shivani   11
4   Vishal   14

In [164]:
#removing a column [axis=0 for row, axis=1 for column]
    #df2.drop(['roll','num'],axis=1)
#creating a copy
new_df2= df2.copy()
new_df2

   Student Grade  num  roll
0     Mary    B-   10   123
1  Shivani    A+   11   124
2   Arpita    A-   12   125
3    Susan    B+   13   126
4   Vishal     C   14   127

In [ ]:
# new_df2.drop(['num'],axis=1,inplace=True

KeyError: "['num'] not found in axis"